#include "dyn_arr.h"

/// <summary>
/// Чтение из файла с предварительным запросом префикса имени файла.
/// Считывание по следующему правилу: 
/// кол-во элементов, затем значения символов
/// </summary>
/// <returns>
/// Структуру содержащую ссылку на 
/// заполненный сиволами массив и количество элементов в нём
/// </returns>
dynCharArrPair readCharArr();

/// <summary>
/// Чтение из файла с предварительным запросом префикса имени файла.
/// Считывание по следующему правилу: 
/// кол-во элементов затем их целочисленные значения
/// </summary>
/// <returns>
/// Структуру содержащую ссылку на 
/// заполненный целыми числами массив и количество элементов в нём
/// </returns>
dynIntArr readIntArr();